[
  {
    "url": "https://en.wikipedia.org/wiki/IPhone",
    "paragraph": "The iPhone is a line of smartphones designed and marketed by Apple Inc. that use Apple's iOS mobile operating system. The first-generation iPhone was announced by then-Apple CEO Steve Jobs on January 9, 2007. Since then, Apple has annually released new iPhone models and iOS updates. As of November 1, 2018, more than 2.2 billion iPhones had been sold.\nThe iPhone has a user interface built around a multi-touch screen. It connects to cellular networks or Wi-Fi, and can make calls, browse the web, take pictures, play music and send and receive emails and text messages. Since the iPhone's launch further features have been added, including larger screen sizes, shooting video, waterproofing, the ability to install third-party mobile apps through an app store, and many accessibility features. Up to iPhone 8 and 8 Plus, iPhones used a layout with a single button on the front panel that returns the user to the home screen. Since iPhone X, iPhone models have switched to a nearly bezel-less front screen design with app switching activated by gesture recognition.\nThe iPhone is one of the two largest smartphone platforms in the world alongside Android, forming a large part of the luxury market. The iPhone has generated large profits for Apple, making it one of the world's most valuable publicly traded companies. The first-generation iPhone was described as \"revolutionary\" and a \"game-changer\" for the mobile phone industry and subsequent models have also garnered praise. The iPhone has been credited with popularizing the smartphone and slate form factor, and with creating a large market for smartphone apps, or \"app economy\". As of January 2017, Apple's App Store contained more than 2.2 million applications for the iPhone."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IOS",
    "paragraph": "iOS (formerly iPhone OS) is a mobile operating system created and developed by Apple Inc. exclusively for its hardware. It is the operating system that powers many of the company's mobile devices, including the iPhone and iPod Touch; the term also included the versions running on iPads until the name iPadOS was introduced with version 13 in 2019. It is the world's second-most widely installed mobile operating system, after Android. It is the basis for three other operating systems made by Apple: iPadOS, tvOS, and watchOS. It is proprietary software, although some parts of it are open source under the Apple Public Source License and other licenses.Unveiled in 2007 for the first-generation iPhone, iOS has since been extended to support other Apple devices such as the iPod Touch (September 2007) and the iPad (introduced: January 2010; availability:  April 2010.) As of March 2018, Apple's App Store contains more than 2.1 million iOS applications, 1 million of which are native for iPads. These mobile apps have collectively been downloaded more than 130 billion times.\nMajor versions of iOS are released annually. The current stable version, iOS 15, was released to the public on September 20, 2021."
  },
  {
    "url": "https://en.wikipedia.org/wiki/History_of_the_iPhone",
    "paragraph": "The history of the iPhone development by Apple Inc. spans from the early 2000s to about 2010. The first iPhone was released in 2007. By the end of 2009, iPhone models had been released in all major markets."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Find_My_iPhone",
    "paragraph": "Find My iPhone (known as Find My Mac in macOS) was an app and service provided by Apple Inc. that allowed remote of iOS devices, Mac computers, Apple Watch, and AirPods. Both Find My iPhone and Find My Friends were combined into the app Find My in iOS 13 and iPadOS 13 in 2019.\nThe service itself was integrated into iOS and macOS, while enabled devices could be tracked using either an iOS app or the iCloud website. On iOS 8 and older, the app could be downloaded from the App Store free of charge. Starting with iOS 9, the app has been bundled with the operating system.For the app to work, both the tracker device and the device being located had to be supported devices with the Find My iPhone app installed and Location Services turned on, and both must have been connected to the same iCloud account."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IOS_version_history",
    "paragraph": "The version history of the mobile operating system iOS, developed by Apple Inc., began with the release of iPhone OS 1 for the original iPhone on June 29, 2007. Since its initial release, it has been used as the operating system for iPhone, iPad, iPod Touch, and HomePod. Continuous development since its initial release resulted in new major releases of the software, typically being announced at the annual Apple Worldwide Developers Conference and later released in September, coinciding with the release of new iPhone models. Starting with the 13.0 release, the operating system for iPad was split off as iPadOS. The latest version of iOS and iPadOS, 15.3, was released on January 26, 2022. The latest beta version of iOS and iPadOS, 15.4 beta, was released on January 27, 2022.Updates can be done over-the-air through Settings (since iOS 5), or via the iTunes or Finder applications."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_(1st_generation)",
    "paragraph": "The iPhone (also known as the iPhone 2G, iPhone 1, iPhone (original))  is the first smartphone designed and marketed by Apple Inc. After years of rumors and speculation, it was officially announced on January 9, 2007, and was released in the United States on June 29, 2007.\nDevelopment of the iPhone as a product began in 2005 and continued in complete secrecy until its public unveiling. The device broke with prevailing mobile phone designs by eliminating most physical hardware buttons, and eschewing a stylus for its screen-based interface, instead featuring only a few physical buttons and a touch screen. It featured quad-band GSM cellular connectivity with GPRS and EDGE support for data transfer, and made use of continuous internet access and onboard processing to support features unrelated to voice communication. Its successor, the iPhone 3G, was announced on June 9, 2008.\nThe iPhone was one of the first handheld devices to combine a multimedia player, telephone, and internet browsing capability on a touchscreen display. It quickly became Apple's most successful product, propelling it to the most profitable company at the time. The introduction of the App Store allowed established companies and startup developers to build careers and earn billions of dollars via the platform, while providing consumers with new ways to access information and connect with other people. The iPhone largely appealed to the general public, as opposed to the business community BlackBerry and IBM focused on at the time, and by integrating existing technology and expanding on usability, the iPhone turned the smartphone industry \"on its head\"."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_X",
    "paragraph": "The iPhone X (Roman numeral \"X\" pronounced \"ten\") is a smartphone designed, developed and marketed by Apple Inc. The 11th generation of the iPhone, it was available to pre-order on October 27, 2017, and was released on November 3, 2017.\nThe iPhone X used a glass and stainless-steel form factor and \"bezel-less\" design, shrinking the bezels while not having a \"chin\", unlike many Android phones. It was the first iPhone to use an OLED screen. The home button's fingerprint sensor was replaced with a new type of authentication called Face ID, which used sensors to scan the user's face to unlock the device. This face-recognition capability also enabled emojis to be animated following the user's expression (Animoji). With a bezel-less design, iPhone user interaction changed significantly, using gestures to navigate the operating system rather than the home button used in all previous iPhones. At the time of its November 2017 launch, its price tag of US$999 also made it the most expensive iPhone ever, with even higher prices internationally due to additional local sales and import taxes.\nThe iPhone X received positive reviews. Its display and build quality were strongly praised, and the camera also scored positively on tests. However, the sensor housing \"notch\" at the top of the screen and the introduction of an all-new authentication method were polarizing for critics and consumers. The notch was heavily mocked by users on social media, although app developers responded either neutrally or positively to the changes it brought to the user experience in their apps and games. Face ID facial recognition was praised for its simple setup, but criticized for requiring direct eyes on the screen, though that option can be disabled within the system preferences.\nAlong with the iPhone 6S, its Plus variant, and the first-generation iPhone SE, the iPhone X was discontinued on September 12, 2018, following the announcement of the iPhone XS, iPhone XS Max and iPhone XR devices.\nOn November 22, 2018, Apple reportedly resumed production of the iPhone X due to weak sales of its successors. The iPhone X remains discontinued, but as of February 2019, Apple started selling refurbished models of the iPhone X."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_XR",
    "paragraph": "The iPhone XR (stylized and marketed as iPhone Xʀ; Roman numeral \"X\" pronounced \"ten\") is a smartphone designed and manufactured by Apple Inc. It is part of the twelfth generation of the iPhone. Pre-orders began on October 19, 2018, with an official release on October 26, 2018.The iPhone XR is the least expensive device in Apple's twelfth generation of iPhones which also includes the iPhone XS and XS Max.  Considered an \"affordable flagship\" or \"budget flagship\" at its release, the XR shares key internal hardware but with features removed/downgraded to reduce the price. The XR features the same processor as the XS and XS Max, the Apple A12 Bionic chip built with a 7 nanometer process, which Apple claims to be the \"smartest and most powerful chip\" ever put into a smartphone. Instead of the OLED screen on the XS, the XR has a 6.1-inch Liquid Retina LED-backlit LCD IPS panel display, which Apple claims is the \"most advanced LCD in the industry.\" According to Apple, the XR battery lasts up to one-and-a-half hours longer than its direct predecessor, the iPhone 8 Plus.The iPhone XR was available in six colors: black, white, blue, yellow, coral (a shade of pink and orange), and Product Red. It is the second iPhone to be released in white, yellow and blue, the first being the iPhone 5C in 2013. Internationally, the phone supports dual SIMs through a Nano-SIM and an eSIM. In mainland China, Hong Kong, and Macau, dual Nano-SIM (in a single tray) is offered instead. The iPhone XR was available in three storage capacities: 64GB, 128GB, and 256GB. The 256GB version was discontinued with the release of the iPhone 11 and 11 Pro; while the iPhone XS was discontinued and replaced by the iPhone 11 Pro, the iPhone XR continued on sale at a lower price point with the iPhone 11 succeeding as the \"affordable flagship\".\nThe iPhone XR was Apple's best selling 2018 model. It also became the top-selling and the most popular smartphone globally in Q3 2019. As of September 2020, the iPhone XR has sold 77.4 million units worldwide, making it the eighth best-selling smartphone of all time.In 2019, Apple started assembling the iPhone XR in India.\nIn May 2020, Apple started selling refurbished iPhone XR models starting at US$499. The price was subsequently lowered to US$419 in October 2020. The iPhone XR as well as the iPhone 12 Pro were discontinued and removed from Apple's website after the announcement of the iPhone 13 and iPhone 13 Pro on September 14, 2021, but is still available through third party retailers today."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Cydia",
    "paragraph": "Cydia is a graphical user interface of APT for iOS. It enables a user to find and install software not authorized by Apple on jailbroken iPhones, iPads and iPod touch devices. It also refers to digital distribution platform for software on iOS accessed through Cydia software. Most of the software packages available through Cydia are free of charge, although some require purchasing.\nCydia is developed by Jay Freeman (named \"saurik\") and his company, SaurikIT. The name \"Cydia\" is a reference to the moth genus Cydia, notably the Codling Moth (Cydia pomonella)."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_XS",
    "paragraph": "The iPhone XS and iPhone XS Max (stylized and marketed as iPhone Xs and iPhone Xs Max; Roman numeral \"X\" pronounced \"ten\") are smartphones designed, developed and marketed by Apple Inc. They are the twelfth-generation flagships of the iPhone, succeeding the iPhone X. Apple CEO Tim Cook announced the devices alongside a lower-end model, the iPhone XR, on September 12, 2018, at the Steve Jobs Theater at Apple Park. Pre-orders began on September 14, 2018, and the devices went on sale on September 21.Improvements besides increased computing speeds include dual-SIM support, filming with stereo audio, and strengthened water resistance.\nThe XS Max was the first plus-sized iPhone to have the newer reduced bezel form factor, as the iPhone X did not have a larger variant. Production of the iPhone XS (and XS Max) ceased on September 10, 2019, after the iPhone 11 and 11 Pro announcement. On January 20, 2020, Apple started selling certified refurbished models starting at $699.\nXS and XS Max are the last models of iPhone to feature 3D Touch."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_8",
    "paragraph": "The iPhone 8 and iPhone 8 Plus are smartphones designed, developed, and marketed by Apple Inc. They make up the 11th generation of the iPhone. The iPhone 8 was released on September 22, 2017, succeeding the iPhone 7 and iPhone 7 Plus and preceding the iPhone X. The iPhone 8 and iPhone 8 Plus were discontinued by Apple on April 15, 2020 with the release of the second-generation iPhone SE.\nExcept for addition of a glass back, the designs of iPhone 8 and 8 Plus are largely similar to that of their predecessors. Notable changes include the removal of the rose gold and jet black color variants, addition of inductive charging, a faster processor, and improved cameras and displays. The iPhone 8 and 8 Plus share most of their internal hardware with the iPhone X.\nReception of the phones was generally positive, with reviewers praising the addition of inductive charging, fast charge capability, and the new Apple A11 processor, while criticizing the aging design that was introduced with the iPhone 6 and iPhone 6 Plus in 2014.\nAs of February 2020, the iPhone 8 and 8 Plus have sold 86.3 million units worldwide, making them the fifth best-selling smartphones of all time."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_6S",
    "paragraph": "The iPhone 6S and iPhone 6S Plus (stylized and marketed as iPhone 6s and iPhone 6s Plus) are smartphones that were designed, developed, and marketed by Apple Inc. It is the ninth generation of the iPhone. They were announced on September 9, 2015, at the Bill Graham Civic Auditorium in San Francisco by Apple CEO Tim Cook, with pre-orders beginning September 12 and official release on September 25, 2015. The iPhone 6S and 6S Plus were succeeded by the iPhone 7 and iPhone 7 Plus on September 7, 2016 and were discontinued with the announcement of the iPhone XS, iPhone XS Max, and iPhone XR on September 12, 2018.\nThe iPhone 6S has a similar design to the iPhone 6 but includes updated hardware, including a strengthened 7000 series aluminium alloy chassis  and upgraded  Apple A9 system-on-chip, a new 12-megapixel rear camera that can record up to 4K video at 30fps at first in the series, can take dynamic \"Live Photos\", the first increase in front camera photo resolution since the 2012 iPhone 5, and also features for the first time front facing \"Retina Flash\" which brightens up the display three times of its highest possible brightness for selfies, 2nd generation Touch ID fingerprint recognition sensor, LTE Advanced support, and \"Hey Siri\" capabilities without needing to be plugged in. The iPhone 6S also introduces a new hardware feature known as \"3D Touch\", which enables pressure-sensitive touch inputs. The iPhone 6S and iPhone 6S Plus are also the first smartphones to use the fastest high end flash storage NVM Express (NVMe). The 6S and 6S Plus, alongside the 1st generation SE, are the only iPhones to be supported through seven major versions of iOS, from iOS 9 to iOS 15.\nThe iPhone 6S had a generally positive reception. While performance and camera quality were praised by most reviewers, the addition of 3D Touch was liked by one critic for the potential of entirely new interface interactions, but disliked by another critic for not providing users with an expected intuitive response before actually using the feature. The battery life was criticized, and one reviewer asserted that the phone's camera was not significantly better than the rest of the industry. The iPhone 6S set a new first-weekend sales record, selling 13 million models, up from 10 million for the iPhone 6 in the previous year. However, Apple saw its first-ever quarterly year-over-year decline in iPhone sales in the months after the launch, credited to a saturated smartphone market in Apple's biggest countries and a lack of iPhone purchases in developing countries."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_6",
    "paragraph": "The iPhone 6 and iPhone 6 Plus are smartphones that were designed and marketed by Apple Inc. They are the eighth generation of the iPhone, succeeding the iPhone 5S, and were announced on September 9, 2014, and released on September 19, 2014. The iPhone 6 and iPhone 6 Plus jointly were themselves replaced as the flagship devices of the iPhone series by the iPhone 6S and iPhone 6S Plus on September 9, 2015. The iPhone 6 and 6 Plus include larger 4.7 and 5.5 inches (120 and 140 mm) displays, a faster processor, upgraded cameras, improved LTE and Wi-Fi connectivity and support for a near field communications-based mobile payments offering.The iPhone 6 and 6 Plus received positive reviews, with critics regarding their redesign, specifications, camera, and battery life as being improvements over previous iPhone models. However, aspects of the design of iPhone 6 were also criticized, including plastic strips on the rear of the device for its antenna that disrupted the otherwise metal exterior, and the screen resolution of the standard-sized iPhone 6 being lower than other devices in its class. The iPhone 6 sold very well, making it the best selling and the most popular iPhone model and one of the most successful phones to date.\nThe iPhone 6 and 6 Plus have been the subject of several hardware issues, including most prominently, being susceptible to bending under hard pressure (dubbed \"Bendgate\"), and as a byproduct of this lack of rigidity, the touchscreen's internal hardware being susceptible to losing its connection to the phone's logic board (nicknamed \"Touch Disease\"). Additionally, some iPhone 6 Plus models were the subject of camera issues, including some with malfunctioning optical image stabilization or otherwise defects on rear cameras.\nThe iPhone 6 and 6 Plus were moved to the midrange spot in Apple's iPhone lineup when the iPhone 6S and 6S Plus were released in September 2015.  The iPhone 6 and 6 Plus were discontinued in most markets on September 7, 2016, when Apple announced the iPhone 7 and iPhone 7 Plus. Their spot as the entry-level iPhone was replaced by the first-generation iPhone SE, which was released earlier on March 31, 2016. The iPhone 6 was relaunched with 32 GB of storage in Asian markets in February 2017 as a midrange/budget iPhone. It was later expanded to Europe, before hitting the US markets in May 2017, and Canada in July 2017. The iPhone 6 and 6 Plus supported iOS 8, 9, 10, 11 and 12 before being dropped by iOS 13, and they are the third to support five versions of iOS after the iPhone 4S and the iPhone 5."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_4",
    "paragraph": "The iPhone 4 is a smartphone that was designed and marketed by Apple Inc. It is the fourth generation of the iPhone lineup, succeeding the iPhone 3GS and preceding the 4S. Following a number of notable leaks, the iPhone 4 was first unveiled on June 7, 2010, at Apple's Worldwide Developers Conference in San Francisco, and was released on June 24, 2010, in the United States, United Kingdom, France, Germany, and Japan. The iPhone 4 introduced a new hardware design to the iPhone family, which Apple's CEO Steve Jobs touted as the thinnest smartphone in the world at the time; it consisted of a stainless steel frame which doubled as an antenna, with internal components situated between two panels of aluminosilicate glass. The iPhone 4 introduced Apple's new high-resolution \"Retina Display\" (with a pixel density of 326 pixels per inch), while maintaining the same physical size and aspect ratio as its precursors, Apple's A4 system-on-chip, along with iOS 4—which notably introduced multitasking functionality and Apple's new FaceTime video chat service. It was the first iPhone at the time to include a front-facing camera, and the first to be released in a version for CDMA networks, ending AT&T's period as the exclusive carrier of iPhone products in the United States.\nThe iPhone 4 received largely positive reception, with critics praising its revamped design and more powerful hardware, in comparison to previous models. While it was a market success (with over 600,000 pre-orders within 24 hours), the release of the iPhone 4 was plagued by highly publicized reports concerning abnormalities in its new antenna design that caused the device to lose its cellular signal if held in a certain way. Most direct contact with the phone's outer edge would cause a significant decrease in signal strength. Apple released iOS 4.0.1 to try and fix these issues, but unsuccessfully.The iPhone 4 spent the longest time as Apple's flagship iPhone model at fifteen months. Although the succeeding 4S was announced in October 2011, the 4 continued to be sold as a midrange model until September 2012, and thereafter as the entry-level offering in Apple's lineup until September 2013 with the announcement of the iPhone 5S/iPhone 5C. The iPhone 4 had the longest lifespan of any iPhone ever produced, spanning close to four years and available in some developing countries until early 2015."
  },
  {
    "url": "https://en.wikipedia.org/wiki/IPhone_SE_(2nd_generation)",
    "paragraph": "The second-generation iPhone SE (also known as the iPhone SE 2 or the iPhone SE 2020) is a smartphone designed and developed by Apple Inc. It is part of the 13th generation of the iPhone, alongside the iPhone 11 and 11 Pro/Pro Max models. Apple announced the second-generation iPhone SE on April 15, 2020, coinciding with the discontinuation of the iPhone 8 and 8 Plus. The iPhone SE succeeded the smaller and lighter first-generation iPhone SE.  Pre-orders began on April 17, 2020, and the phone was subsequently released on April 24, 2020. It was released with a starting price of US$399, and positioned as a budget phone.Following the pattern made by the first-generation iPhone SE (which shares the dimensions and form factor of the iPhone 5S, with the internal hardware of the iPhone 6S), the second-generation model shares the dimensions and form factor of the iPhone 8, while sharing selected internal hardware components from the iPhone 11 lineup, including the A13 Bionic system-on-chip (as opposed to the A11 Bionic system-on-chip found in the iPhone 8 series), which allows the phone to utilise the single Wide angle lens Portrait Mode, as on the iPhone XR. It also features the next generation Smart HDR-2 photos, which are marketed as being better than Smart HDR photos on the iPhone XS and iPhone XR."
  }
]
