[
  {
    "url": "https://en.wikipedia.org/wiki/Avengers:_Endgame",
    "paragraph": "Avengers: Endgame is a 2019 American superhero film based on the Marvel Comics superhero team the Avengers. Produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures, it is the direct sequel to Avengers: Infinity War (2018) and the 22nd film in the Marvel Cinematic Universe (MCU). Directed by Anthony and Joe Russo and written by Christopher Markus and Stephen McFeely, the film features an ensemble cast including Robert Downey Jr., Chris Evans, Mark Ruffalo, Chris Hemsworth, Scarlett Johansson, Jeremy Renner, Don Cheadle, Paul Rudd, Brie Larson, Karen Gillan, Danai Gurira, Benedict Wong, Jon Favreau, Bradley Cooper, Gwyneth Paltrow, and Josh Brolin. In the film, the surviving members of the Avengers and their allies attempt to reverse the destruction caused by Thanos in Infinity War.\nThe film was announced in October 2014 as Avengers: Infinity War – Part 2, but Marvel later removed this title. The Russo brothers joined as directors in April 2015, with Markus and McFeely signing on to write the script a month later. The film serves as a conclusion to the story of the MCU up to that point, ending the story arcs for several main characters. The plot revisits several moments from earlier films, bringing back actors and settings from throughout the franchise. Filming began in August 2017 at Pinewood Atlanta Studios in Fayette County, Georgia, shooting back-to-back with Infinity War, and ended in January 2018. Additional filming took place in the Metro and Downtown Atlanta areas, New York state, Scotland, and England. The official title was revealed in December 2018. With an estimated budget of $356–400 million, the film is one of the most expensive films ever made.\nAvengers: Endgame premiered in Los Angeles on April 22, 2019, and was released in the United States on April 26, as part of Phase Three of the MCU. The film received praise for its direction, acting, musical score, action sequences, visual effects, and emotional weight, with critics lauding its culmination of the 22-film story. The film grossed $2.798 billion worldwide, surpassing Infinity War's entire theatrical run in just eleven days and breaking numerous box office records, including becoming the highest-grossing film of all time, which it held from July 2019 until March 2021. The film received numerous awards and nominations, including a nomination for Best Visual Effects at the 92nd Academy Awards, three nominations at the 25th Critics' Choice Awards (winning two), and a nomination for Special Visual Effects at the 73rd British Academy Film Awards."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Avengers:_Endgame_(soundtrack)",
    "paragraph": "Avengers: Endgame (Original Motion Picture Soundtrack) is the film score for the Marvel Studios film Avengers: Endgame by Alan Silvestri. Hollywood Records released the soundtrack album digitally on April 26, 2019, with the physical formats being released on May 24, 2019."
  },
  {
    "url": "https://en.wikipedia.org/wiki/List_of_box_office_records_set_by_Avengers:_Endgame",
    "paragraph": "Avengers: Endgame is the fourth Avengers film and the 22nd film in the Marvel Cinematic Universe (MCU), released seven years after the first Avengers film and eleven years after the first MCU film. Directed by Anthony and Joe Russo, the film features an ensemble cast of actors reprising their roles from previous entries in the MCU.\nEndgame was released in April 2019 and went on to break numerous box office records in various markets. Worldwide, it set the record for highest-grossing film of all time, the highest opening weekend gross, and the fastest cumulative grosses through $2.5 billion. In its domestic market of the US and Canada, it set the records for the highest-grossing opening weekend, single day, Friday, Saturday, and Sunday as well as the fastest cumulative grosses through $650 million. Elsewhere, it became the highest-grossing film of all time in several markets including Chile and Thailand, set the record for highest opening weekend gross in more than 40 markets including Australia, Brazil, China, Egypt, Mexico, and the United Kingdom, and set various IMAX records in 50 different markets across all six inhabited continents. Many of the records set by the film are listed below. Data on the previous record and records that have since been surpassed are presented where available and applicable. All grosses are given in unadjusted US dollars, except where noted otherwise."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Production_of_Avengers:_Infinity_War_and_Avengers:_Endgame",
    "paragraph": "Avengers: Infinity War and Avengers: Endgame are American superhero films based on the Marvel Comics superhero team the Avengers, produced by Marvel Studios and distributed by Walt Disney Studios Motion Pictures. They are the sequels to Marvel's The Avengers (2012) and Avengers: Age of Ultron (2015), and serve as the 19th and 22nd films of the Marvel Cinematic Universe (MCU), respectively. Both films are directed by Anthony and Joe Russo from screenplays by the writing team of Christopher Markus and Stephen McFeely, and feature an ensemble cast composed of many previous MCU actors.\nDevelopment of the films began in Marvel Studios' early films by introducing the Infinity Stones and the Infinity Gauntlet as plot devices. Casting began in mid-2013 with Robert Downey Jr. signing on to reprise his role as Tony Stark / Iron Man, with the films officially announced a year later as Avengers: Infinity War, Part 1 and Part 2. The Russo brothers and Markus and McFeely joined the project in early 2015. In July 2016, Marvel revealed that the films were being renamed: the first part became known simply as Avengers: Infinity War, while the second part's title was revealed as Avengers: Endgame in December 2018. The films were renamed because they were intended to tell two different stories. They were designed as a conclusion to the storyline told in all the MCU films up to that point.\nBoth films were shot back-to-back at Pinewood Atlanta Studios in Fayette County, Georgia. Production of Infinity War began on January 23, and concluded on July 14, 2017, with additional filming in Scotland, the Downtown Atlanta area, and New York City. Filming of Avengers: Endgame began on August 10, 2017 and concluded on January 11, 2018, with additional filming in the Downtown and Metro Atlanta areas, New York state, Scotland, and England. They are the first Hollywood films to be shot entirely in digital IMAX, using a new camera developed alongside Arri. Industrial Light & Magic, Framestore, Method Studios, Weta Digital, DNEG, Cinesite, Digital Domain, Rise, Lola VFX, Perception, Cantina Creative, Capital T, Technicolor VFX, and Territory Studio were the visual effects companies to work on the films.\nAvengers: Infinity War was released on April 27, 2018, and Avengers: Endgame was released on April 26, 2019, both part of Phase Three of the MCU."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Features_of_the_Marvel_Cinematic_Universe",
    "paragraph": "The Marvel Cinematic Universe (MCU) media franchise features many fictional elements including locations, weapons, and artifacts. While many of these features are based on elements that originally appeared in the American comic books published by Marvel Comics, some features were created specifically for the MCU."
  }
]
