[
  {
    "url": "https://en.wikipedia.org/wiki/See_You_Again",
    "paragraph": "\"See You Again\" is a song by American rapper Wiz Khalifa, featuring American singer Charlie Puth. It was commissioned for the soundtrack of the 2015 film Furious 7 as a tribute to actor Paul Walker, who died in a single-vehicle accident on November 30, 2013. Later on, the song was included as a bonus track on the international release of Puth's debut album, Nine Track Mind. The artists co-wrote the song with its co-producers, DJ Frank E and Andrew Cedar, with additional production from Puth and mixing provided by Manny Marroquin. \"See You Again\" was released on March 10, 2015, as the soundtrack's lead single in the United States.\n\"See You Again\" became both Khalifa's and Puth's biggest single to date. It spent 12 non-consecutive weeks atop the US Billboard Hot 100, tying Eminem's \"Lose Yourself\" for the second longest-running rap number-one single in the country behind Lil Nas X & Billy Ray Cyrus' \"Old Town Road\", and topped the UK Singles Chart for two consecutive weeks. It also reached number one in several other countries including Australia, Austria, Canada, Germany, Ireland, New Zealand and Switzerland. The song held the record for the most-streamed track in a single day on Spotify in the United States, until it was surpassed by One Direction's \"Drag Me Down\". It set the record for most streams in a single week worldwide, and in the United Kingdom also in a single week.\nThe music video was the most viewed video on YouTube from July 10 to August 4, 2017. \"See You Again\" received three nominations at the 58th Annual Grammy Awards: Song of the Year, Best Pop Duo/Group Performance and Best Song Written for Visual Media. It was also shortlisted for the Song of the Year for the BBC Music Awards and was nominated for Best Original Song at the 73rd Golden Globe Awards. \"See You Again\" was the best selling-song of 2015 worldwide, with combined sales and track-equivalent streams of 20.9 million units according to IFPI."
  },
  {
    "url": "https://en.wikipedia.org/wiki/When_Will_I_See_You_Again",
    "paragraph": "\"When Will I See You Again\" is a song released in 1974 by American soul group The Three Degrees, from their third album The Three Degrees. The song was written and produced by Kenny Gamble and Leon Huff. Sheila Ferguson sang the lead, accompanied by Fayette Pinkney and Valerie Holiday. Billboard named the song #67 on their list of 100 Greatest Girl Group Songs of All Time."
  },
  {
    "url": "https://en.wikipedia.org/wiki/See_You_Again_(TV_series)",
    "paragraph": "See You Again (Chinese: 时间都知道; pinyin: Shíjiān Dōu Zhīdào; lit. 'Time Knows Everything') is a 2019 Chinese television series based on the novel of the same name by Sui Houzhu. It stars Tiffany Tang, Shawn Dou and Yang Shuo. It aired on Beijing TV from July 16 to August 7, 2019."
  },
  {
    "url": "https://en.wikipedia.org/wiki/See_You_Again_(Miley_Cyrus_song)",
    "paragraph": "\"See You Again\" is the debut single by American singer Miley Cyrus. It was released on October 1, 2007, as the lead single from Meet Miley Cyrus (2007), the second soundtrack album from the Disney Channel original series Hannah Montana and the debut studio album of Cyrus. It was written by Cyrus (credited as Destiny Hope Cyrus) with the song's producers Antonina Armato and Tim James. Later, it was remixed by Rock Mafia as the second single from Cyrus' second studio album, Breakout (2008). Musically, the track is a dance-rock song that contains influences from various musical genres, including electronic music. Lyrically, it speaks of teenage romance. The original version of the song was only released as a single in the US, Canada, Australia and New Zealand. The song was released internationally remixed by Rock Mafia.\n\"See You Again\" received acclaim from music critics, with many complimenting its composition and Cyrus' vocals. It was her first commercially successful song; it introduced her to new audiences and new countries, paving the way for future hits. The song went top ten in the US, Canada, Hungary and Australia. Although a music video for the song was never filmed, it was given a promotional clip for the remix version, taken from a performance at the 2008 Disney Channel Games. The song was promoted through a multitude of live television performances. It was included on the setlist of Cyrus' headlining tours, the Best of Both Worlds Tour (2007–08), the Wonder World Tour (2009) and the Gypsy Heart Tour (2011). \"See You Again\" has been covered by various notable artists, including Little Boots and Breathe Carolina."
  },
  {
    "url": "https://en.wikipedia.org/wiki/When_Can_I_See_You_Again%3F",
    "paragraph": "\"When Can I See You Again?\" is a song recorded by Owl City for the 2012 Walt Disney Animation Studios film Wreck-It Ralph. It was written and produced by Adam Young, with additional writing from Matt Thiessen and Brian Lee."
  },
  {
    "url": "https://en.wikipedia.org/wiki/When_I_See_You_Again",
    "paragraph": "When I See You Again (Chinese: 他看她的第2眼; pinyin: tā kàn tā de dì èr yǎn ) is a 2015 Taiwanese romantic comedy television series produced by Sanlih E-Television, starring Jasper Liu, Mandy Wei, Jet Chao and Ivy Shao as the main cast. The Chinese title literally translates to \"He Saw Her A 2nd Time\". Filming began on May 12, 2015 and continued as it aired. First original broadcast began May 31, 2015 on TTV channel airing on Sunday nights from 10:00–11:30 pm."
  },
  {
    "url": "https://en.wikipedia.org/wiki/See_You_Again_(disambiguation)",
    "paragraph": "\"See You Again\" is a song by Wiz Khalifa featuring Charlie Puth.\nSee You Again may also refer to:\n\n\"See You Again\" (Miley Cyrus song), 2007\n\"See You Again\" (Carrie Underwood song), 2013\n\"See You Again\", a 2013 song by I Am I\n\"See You Again\", a song by Elle King from Love Stuff\n\"See You Again\", a song by Loreen from Heal\n\"See You Again\", a song by Tyler, The Creator from Flower Boy\nSee You Again (TV series), a 2018 Chinese television series"
  },
  {
    "url": "https://en.wikipedia.org/wiki/See_You_Again_(Tyler,_the_Creator_song)",
    "paragraph": "\"See You Again\" is a song by American rapper Tyler, the Creator and the fourth single from his fourth studio album Flower Boy (2017), released on August 29, 2017. The song features vocals from American singer Kali Uchis."
  },
  {
    "url": "https://en.wikipedia.org/wiki/You_Again",
    "paragraph": "You Again is a 2010 American comedy film produced by John J. Strauss and Eric Tannenbaum and directed by Andy Fickman with music by Nathan Wang and written by Moe Jelline. The film stars Kristen Bell, Jamie Lee Curtis, Sigourney Weaver, Odette Yustman, James Wolk, Victor Garber, Billy Unger, Kyle Bornheimer, Kristin Chenoweth, and Betty White in her final live-action film acting role before her death in 2021.\nThe film was released on September 24, 2010, by Touchstone Pictures to negative reviews from critics and it earned $32 million against a production budget of $20 million. It was the last solo Touchstone Pictures project before working on subsequent films in association with Miramax, DreamWorks, Studio Ghibli and Lucasfilm. As a result of this, Touchstone signed a deal with DreamWorks Pictures in 2011 starting with I Am Number Four."
  },
  {
    "url": "https://en.wikipedia.org/wiki/If_Ever_I_See_You_Again",
    "paragraph": "\"If Ever I See You Again\" is the title of a 1978 hit single by Roberta Flack. The song was composed by Joseph \"Joe\" Brooks and served as the title song for the 1978 film If Ever I See You Again, which Brooks directed and also starred in with Shelley Hack as his leading lady. Male vocalist Jamie Carr sang the theme song on the film's soundtrack.\nBrooks' directorial debut, You Light Up My Life, had become successful largely on the strength of its title song, which as recorded by Debby Boone had spent ten weeks at #1 on the Billboard Hot 100 in 1977. With Brooks producing, Debby Boone had subsequently recorded the If Ever I See You Again title song plus four other songs heard in the film: \"California\", \"Come Share My Love\", \"It Was Such a Good Day\" and \"When It's Over\", at the Hollywood recording studio the Record Plant in January 1978, with the track \"California\" being issued as Boone's follow-up single to \"You Light Up My Life\" in February 1978 to reach #50 on the Hot 100. Boone's version of the If Ever I See You Again title song, plus the four other songs from the film that she'd recorded, would be included on her July 1978 album release Midstream.\nDespite Boone's success with the theme song from You Light Up My Life, Brooks was hoping to place the If Ever I See You Again theme song plus other songs from the film with an established artist. According to his partner Robert K. Lifton, Brooks offered the If Ever I See You Again numbers to Arista Records president Clive Davis for Barry Manilow to record only to renege after hearing the existing tracks intended for Manilow's upcoming album, which Brooks felt were sub-par and would sink his own compositions (in fact Manilow's 1978 album release Even Now would be a triple platinum seller).Brooks then approached Atlantic Records president Jerry Greenberg with the intent of having the If Ever I See You Again theme song and other songs from the film recorded by Roberta Flack (Flack has stated that she had been offered \"You Light Up My Life\" prior to the Debby Boone recording: (Roberta Flack quote:)\"Some people whose opinions I respect very much suggested I should do it...but the song reminded me of too many other things that I had heard or sung and I just didn't like it [although] I think [for] Debby Boone ['You Light Up My Life'] was perfect\". Flack would eventually describe \"If Ever I See You Again\" as \"a song I couldn't stand\" that Greenberg insisted she record: (Roberta Flack quote:) \"I had a very clever lawyer who made a huge money deal for [my recording] that song\": Flack recorded \"If Ever I See You Again\" at A&R Recording Studios in New York City in a session produced by Brooks which also yielded Flack's versions of \"Come Share My Love\" and \"When It's Over\". With a track from Flack's 1977 Blue Lights in the Basement album: \"I'd Like To Be Baby To You\", as B-side, \"If Ever I See You Again\" was released as a single on 21 April 1978 - a month before the film's premiere - to debut the Billboard Hot 100 dated 20 May 1978 at #87 (the same chart ranked the Blue Lights in the Basement single: the Donny Hathaway duet \"The Closer I Get to You\" at its #2 peak for a second and final week).\nWith the film If Ever I See You Again quickly proving a massive flop, Flack's single was left to fare on its own merit, and did in July 1978 spend three weeks at No. 1 on the Easy Listening chart with an eventual ranking as the #8 Easy Listening hit for the year: however, while reaching the Top 40 on both the Pop-oriented Hot 100 and the R&B chart, \"If Ever I See You Again\" was not on either chart afforded the impact which had previously been customary for Flack's lead singles, the Hot 100 peak for \"If Ever I See You Again\" being #24 with its R&B peak being #37. On the pop-oriented singles charts published in both Cashbox and Record World, \"If Ever I See You Again\" peaked at #38, with the single's peak on the respective magazines' R&B charts being #37 (Cashbox) and #58 (Record World)).\n\"If Ever I See You Again\" was included on the August 1978 album release Roberta Flack - the planned album title of If Ever I See You Again being dropped due to the single's underperformance - , that album also including the two other tracks cut with Joe Brooks at A&R Studios: \"Come Share My Love\" and \"When It's Over\",  the two latter tracks being issued on a single in October 1978 with the A-side \"When It's Over\" reaching #82 on the R&B chart.\nFrom 1979 Flack would tend to rank on the R&B chart as opposed to the Hot 100, her only solo Hot 100 entry subsequent to \"If Ever I See You Again\" being another movie theme song: \"Making Love\", which peaked at #13 in 1982. However Flack did reach the Top 20 of the Hot 100 with two duets: \"Tonight, I Celebrate My Love\" with Peabo Bryson (#16/ 1983) and \"Set the Night to Music\" with Maxi Priest (#6/ 1991)."
  },
  {
    "url": "https://en.wikipedia.org/wiki/Charlie_Puth",
    "paragraph": "Charles Otto Puth Jr. (; born December 2, 1991) is an American singer, songwriter, and record producer. His initial exposure came through the viral success of his song videos uploaded to YouTube.\nAfter initially signing with eleveneleven after performing on The Ellen DeGeneres Show, Puth began contributing to songs and albums for other artists, as well as creating lite solo material and covers of popular songs. With primary intent on a solo career, Atlantic Records and Artist Partner Group eventually sought the artist and released his debut single, \"Marvin Gaye\" (featuring Meghan Trainor), in 2015. His next single and first feature, \"See You Again\", which he co-wrote, co-produced, and performed with Atlantic label-mate Wiz Khalifa for the Furious 7 soundtrack as a tribute to actor Paul Walker. It peaked at number one on the US Billboard Hot 100 for 12 non-consecutive weeks. After the success of \"See You Again\", he gained worldwide recognition for multiple subsequent releases, including his next single, \"One Call Away\". The single reached number 12 on the Billboard Hot 100.\nPuth's debut studio album, Nine Track Mind, was released in January 2016 to moderate commercial success despite generally negative reviews from critics. The album was preceded by the singles \"One Call Away\" and \"We Don't Talk Anymore\" (featuring Selena Gomez), which peaked at number 12 and number 9 respectively on the Billboard Hot 100. In 2017, he released two songs, \"Attention\" and \"How Long\", with the former peaking at number 5 on the Billboard Hot 100. Both were included on his second studio album, Voicenotes (2018), with ameliorated critical reception and a peak of number 4 on the Billboard 200. In 2019, Puth released the singles \"I Warned Myself\", \"Mother\" and \"Cheating on You\". The following year, Puth released singles \"Girlfriend\" and \"Hard on Yourself.\""
  },
  {
    "url": "https://en.wikipedia.org/wiki/I%27d_Like_to_See_You_Again",
    "paragraph": "I'd Like to See You Again is the fourth studio album by English post-punk band A Certain Ratio, released in 1982 by record label Factory.\nThe album spent twelve weeks in the UK Independent Chart, peaking at number 2."
  },
  {
    "url": "https://en.wikipedia.org/wiki/If_Ever_I_See_You_Again_(film)",
    "paragraph": "If Ever I See You Again is a 1978 American romantic drama film about a composer who rekindles his relationship with a former girlfriend. It stars Joe Brooks, who also co-wrote, produced, directed, and scored the film, and Shelley Hack. The film's theme song, \"If Ever I See You Again\", was a moderate hit for Roberta Flack, reaching #24 on the Billboard Hot 100 chart."
  }
]
